ใบงาน 5
1. #Name - ผิด
ไม่สามารถใช้เครื่องหมาย # ในการประกาศตัวแปร
2. True - ผิด
True เป็นตัวแปรใช้เพื่อแทนค่าที่เป็นจริง
3. name – ถูก
4. return - ผิด
return เป็นตัวแปรใช้เพื่อส่งค่ากลับ
5. first name____ - ถูก
6. first_name__ - ถูก
7. "haha". - ผิด
ไม่สามารถประกาศตัวแปรโดยใช้(.) ได้
8. lion - ถูก
9. gr@de_ - ผิด
ไม่สามารถใช้เครื่องหมาย @ ในการตั้งชื่อตัวแปรได้
10. if - ผิด
if ใช้เพื่อท าเงื่อนไข
11. while - ผิด
while ใช้เพื่อสร้างลูปที่ท างานตามเงื่อนไขที่ก าหนด
12. [b]. - ผิด
(.) ไม่สามารถใช้ในการตั้งชื่อตัวแปรได้
13. _name - ถูก
14. py Thon - ผิด
ชื่อตัวแปรไม่สามารถมีช่องว่างได้
15. 20 - ผิด
ตัวแปรไม่สามารถขึ้นต้นด้วยตัวเลขได้
